#+TITLE: The Linkspace Protocol Guide
#+AUTHOR: Anton Sol
#+OPTIONS: H:3 num:nil \n:nil ::nil |:t ^:{}  *:t author:nil email:nil creator:nil 
#+OPTIONS: html-style:nil

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>

#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/src/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/js/readtheorg.js"></script>

#+LANGUAGE: en


#+BEGIN_VERSE
This is a living document, it is not yet finished, things are broken, and is kept up to date on a best effort basis.
Sometimes the [[../cargo-doc/liblinkspace/index.html][liblinkspace]] docs is ahead of this guide.
#+END_VERSE

**** Bash


#+BEGIN_SRC bash :session cli2 :exports both :results output verbatim
echo -n "Hello, Sol" | lk data | lk printf "{hash:str}\n{data}"
#+END_SRC

#+RESULTS:
#+begin_example
RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0
Hello, Sol
#+end_example



**** Python
:PROPERTIES:
:CUSTOM_ID: datapoint-py
:END:
#+begin_src python :session lkpy :exports both :cache
import lkpy
from lkpy import * 
datap = lk_datapoint(b"Hello, Sol")
lk_eval2str("{hash:str}\\n{data}",datap)
#+END_SRC

#+RESULTS:
#+begin_example
RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0
Hello, Sol
#+end_example



**** Bash
The command ~lk link~ can build linkpoint packets and output's them to stdout by default.
When cli commands deal with (domain,group,path) tuples the are set in the first argument as ~DOMAIN:GROUP:PATH~.
Two links are added with the tags ~first_tag_1~ and ~another_tag~

#+BEGIN_SRC bash :session cli0 :results output verbatim :cache yes
    lk link "a_domain:{#:pub}:/dir1/dir2/thing" \
              -l first_tag_1:RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0 \
              -l another_tag:{#:pub} \
    | lk printf
#+END_SRC

#+RESULTS[3ae043189c4cd0bcd3c269ec882df837dd76675b]:
#+begin_example
type	LinkPoint
hash	cKuhaOJtW_Dimh5KaVif6h3BGQbw-0F4C4Vi8iU2BIE
group	{#:pub}
domain	\0\0\0\0\0\0\0\0a_domain
path	/dir1/dir2/thing
pubkey	{@:none}
create	1676648505181565
links	2
	\0\0\0\0\0first_tag_1 RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0
	\0\0\0\0\0another_tag RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0

data	0
#+end_example

**** Bash

#+CAPTION: Setup an instance and generate a key
#+BEGIN_SRC bash :session cli0 :results output verbatim :cache yes
  export LINKSPACE=/tmp/linkspace
  lk --init key --insecure --password "" 
#+END_SRC

#+RESULTS[e601ae674e1a8b182247d963223a20a7d517b66f]:
#+begin_example
$argon2d$v=19$m=8,t=1,p=1$QU/Qi+i+ZnbBeQhpWUUgln76qd3LwP5dw7oaz1+94yw$+2FJuz4KS5fIFO/IoJSHde9fbTJ8UZ0t2QERsnHwooo=
QU_Qi-i-ZnbBeQhpWUUgln76qd3LwP5dw7oaz1-94yw
#+end_example
 
#+BEGIN_SRC bash :session cli0 :results output verbatim :cache yes
lk keypoint "example::" --sign --password "" | lk printf
#+END_SRC

#+RESULTS[f4310e4dbc1c142cf2363bc8c85c5371e9bf5724]:
#+begin_example
type	KeyPoint
hash	lTy6O3_knJhAJCUCmgqogW-_8t84fIbtOP7Ec8-aNLs
group	{#:pub}
domain	\0\0\0\0\0\0\0\0\0example
path	
pubkey	{b:QU_Qi-i-ZnbBeQhpWUUgln76qd3LwP5dw7oaz1-94yw}
create	1676648556784321
links	0

data	0
#+end_example

#+BEGIN_VERSE
The CLI also accepts ~lk link --sign~ instead of ~lk keypoint~
#+END_VERSE


#+RESULTS:
** lk_eval

ABE is evaluated by substituting an expressions ( ~{..}~ ) with its result.
For example in ~{u8:97}~, the function 'u8' parses "97" and prints it.
The byte 97 equals the character 'a'. 

#+BEGIN_SRC bash :session cli0 :results output verbatim :cache yes
lk eval "ab{u8:99}" | xxd
#+END_SRC

#+RESULTS[fd4e0fd46d344e3019226aa7c8529c625d8d4866]:
#+begin_example
00000000: 6162 63                                  abc
#+end_example

The result of an ABE is a list of (bytes, ?delimiter). 
#+BEGIN_SRC bash :session cli0 :results output verbatim :cache yes
lk eval --json "h{u8:101}ll{u8:111} / world:etc" 
#+END_SRC

#+RESULTS[f318b0d8714722833484edb5751f5bd92d11a993]:
#+begin_example
[[[104,101,108,108,111,32],"/"],[[32,119,111,114,108,100],":"],[[101,116,99],null]]
#+end_example

Note that bytes are joined after evaluating. In the example this results in the component ~('hello ', /)~.
The delimiters (\n \t : /) are interpreted depends on the context.
In the context of ~linkspace eval~ the delimiters are simply printed as is.

#+Begin_VERSE
The rest of this chapter goes further in depth.
With the basic of expression substition (~{..}~) and the ~':'~, ~'/'~ delimiters the reader can choose to
skip to the next chapter [[Query]] and return here for reference later.
#+end_VERSE


**** bash
<<printf>>
~printf~ is similar to ~eval~ except that it reads packets from stdin and uses them as context.
#+BEGIN_SRC bash :session cli0 :results output verbatim :cache yes
lk link "::" -l tag1:{#:0} -l tag2:{#:pub} | lk printf "HASH:{hash/?b}\n{/links:TAG = {tag:str} PTR = {ptr:str} \n}"
#+END_SRC

#+RESULTS[b0396780053c0d0f4b4e6023739840225d6f2168]:
#+begin_example
HASH:fU0UKGlknPFe6y0Bn_gtrdbEd5XbA8PdTvpor90D9Ho
TAG = \0\0\0\0\0\0\0\0\0\0\0\0tag1 PTR = AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA 
TAG = \0\0\0\0\0\0\0\0\0\0\0\0tag2 PTR = RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0
#+end_example

**** bash

#+Caption: A query that matches keypoints with domain 'my' , group '{#:pub}' , path with 2 components starting with  '/hello'
#+BEGIN_SRC bash :exports both :session cli0 :results output verbatim :cache yes
lk print-query "my:{#:pub}:/hello:*" --signed
#+END_SRC

#+RESULTS[5485c7e63349cf14ff042649c2acfb5dbb2f5941]:
#+begin_example
type:1:{b2:00000111}
domain:=:{a:my}
group:=:{b:RD3ltOheG4CrBurUMntnhZ8PtZ6yAYF_C1urKGZ0BB0}
prefix:=:/hello
path_len:<:{u8:3}
path_len:>:{u8:0}
#+end_example

#+BEGIN_VERSE 
Note that many cli commands (e.g. ~print-statemnt~, ~watch~ ) take as the first argument a ~domain:group:path:[?depth]~
If no depth is set the path_len is constraint by default.
Except for ~watch-tree~ which sets the depth to unconstraint by default
#+END_VERSE 

